---
type: SketchedStairsCurveData
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SketchedStairsCurveData

`Autodesk.Revit.DB.SketchedStairsCurveData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SketchedStairsCurveData | 2015 | `public SketchedStairsCurveData ( Curve boundaryCurve , double height , SketchedCurveSlopeOption slopeType )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurve | 2015 | `public Curve GetCurve ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |